"use strict";

/*
Используя Math.random() необходимо сгенерировать массив, содержащий 5 цифр в 
диапазоне [0, 9].
После создания массива необходимо вывести в консоль следующие значения:
1. Сумму элементов массива
2. Минимальное значение в массиве
3. Новый массив, содержащий индексы сгенерированного выше массива, в которых 
значение равно 3.
Пример: Если у нас сгенерировался массив [2, 3, 5, 7, 3], то мы должны вывести 
в консоль массив [1, 4]. Такой массив получился потому что в сгенерированном
массиве тройки лежат под индексами 1 и 4. Если троек в сгенерированном массиве
не окажется, значит нужно будет вывести пустой массив.
*/


// let arr3 = [];
// let sum = 0;
// let min = 10; // Начальное минимальное значение должно быть больше 9, чтобы min = Math.min(min, arr3[i]) работало в текущем зд.
// let arr31 = [];
// for (let i = 0; i < 5; i++) {
//     arr3[i] = Math.trunc(Math.random() * 10);  
//     sum += arr3[i];
//     min = Math.min(min, arr3[i]);   // в следующем вар. кода нашел Math.min(...arr3)
//     if (arr3[i] === 3) {
//         arr31.push(i);
//     }
// }
// console.log("Сгенерированный массив:", arr3);
// console.log("Сумма элементов массива:", sum);
// console.log("Минимальное значение в массиве:", min);
// console.log("Индексы элементов со значением 3:", arr31);

//тут поискал другой вариант кода, вроде получилось улучшить
const arr3 = Array.from({ length: 5 }, () => Math.trunc(Math.random() * 10));
console.log("Сгенерированный массив:", arr3);

const sum = arr3.reduce((accumulator, currentValue) => accumulator + currentValue, 0);
console.log("Сумма элементов массива:", sum);

const min = Math.min(...arr3);
console.log("Минимальное значение в массиве:", min);

const arr31 = [];
arr.forEach((el, i) => {
    if (el === 3) {
        arr31.push(i);
    }
});
console.log("Индексы элементов со значением 3:", arr31);
